Revit 2027 API
PropertyTableEntry Properties
The PropertyTableEntry type exposes the following members.
Properties
Name | Description
ArcDirection |  Represent the arc direction, PT_Left means the arc appears to the left of the line segment. Right means the arc appears to the right of the line segment.
Bearing |  The bearing angle value of the PropertyTableEntry
CurveType |  The curve type for this PropertyTableEntry
Distance |  The distance value of the PropertyTableEntry
Id |  Unique identifier for this PropertyTableEntry
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Radius |  The radius for arc type curve The radius value must be greater than half the length of the line segment. The larger the radius, the larger the circle becomes, resulting in a flatter arc.
Top
See Also
Reference
PropertyTableEntry Class
Autodesk.Revit.DB Namespace